import { BehaviorItem } from "./BehaviorBlock";

export const allowedTexts: BehaviorItem[] = [
  {
    title: "Спокойно попросить время на раздумья",
    example:
      "«Мне нужно обдумать ситуацию. Давайте вернёмся к этому разговору завтра»",
  },
  {
    title: "Вежливо попросить разъяснить причины увольнения",
    example:
      "«Не могли бы вы подробнее объяснить, почему принято решение о моём увольнении?»",
  },
  {
    title: "Запросить письменное уведомление об увольнении",
    example:
      "«Пожалуйста, предоставьте мне письменное уведомление с указанием причин увольнения.»",
  },
  {
    title: "Уточнить, какие выплаты вам полагаются",
    example:
      "«Какие компенсации предусмотрены в моём случае согласно трудовому договору и закону?»",
  },
];
