import { BehaviorItem } from "./BehaviorBlock";

export const forbiddenTexts: BehaviorItem[] = [
  {
    title: "Соглашаться на увольнение по собственному желанию под давлением",
    example:
      "«Да, начальник, конечно, я уволюсь по-собственному»",
  },
  {
    title: "Подписывать какие-либо документы, не изучив их внимательно",
    example:
      "«Давайте я просто подпишу, чтобы не задерживать процесс».",
  },
  {
    title: "Угрожать работодателю или вступать в конфликт",
    example:
      "«Я всё равно засужу вашу компанию! Вы ещё пожалеете!»",
  },
  {
    title: "Игнорировать ситуацию, надеясь, что всё разрешится само собой",
    example:
      "Просто перестать ходить на работу, не выясняя деталей увольнения.",
  },
];
